import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:new_project/splash.dart';
import 'About page.dart';
import 'information.dart';
import 'package:share_plus/share_plus.dart';

void main() {
  runApp(const MaterialApp(
    debugShowCheckedModeBanner: false,
    home: SplashScreen(),
  ));
}

class Main extends StatefulWidget {
  const Main({super.key});

  @override
  State<Main> createState() => _MainState();
}

class _MainState extends State<Main> {
  List images = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'];
  List link = [
    'https://wikipwdia.com/',
    'https://gmail.com/',
    'https://email.com/',
    'https://gogele.com/',
    'https://facebook.com/',
    'https://instgram.com/',
    'https://telegram.com/',
    'https://watsapp.com/',
    'https://wikipwdia.com/',
    'https://gmail.com/',
  ];

  List names = [
    'خالد ابن ولید',
    'اباعبیده ابن جراح',
    'مصعب ابن عمیر',
    'انس ابن مالک',
    'ابوسفیان',
    'زید ابن ثابت',
    'زبیر ابن عوام',
    'بلال',
    'طلحه',
    'عبدالله ابن مسعود'
  ];
  List details = [
    'خالد بن ولید بن مغیره مخزومی ابو سلیمان، یکی از صحابه پیامبر اسلام بود که به او لقب »سیف الدین« )شمشیر برنده خدا( را داده اند پدرش، ولید بن مغیره از سرسخت ترین دشمنان اسلام و از نخستین کسانی بود که پیامبر را مسخره کرد ',
    "بوعبیدھس از جمله گروه نخستین مسلمانان بود، که یک روز بعد از اسلام حضرت ابوبکر به وسیلۀ خود حضرت ابوبکرس، به اسلام ھدایت شد و به دین حق مشرف گشت. حضرت ابوبکر صدیق، ابوعبیده، عبدالرحمن بن عوف، حضرت عثمان بن مظعون و ارقم بن ابی الارقمش را به"
   " حضور پیامبرص معرفی کرد  و در حضور حضرت پیامبرص کلمۀ حق را به زبان آورده و به آن اقرار کردند. بدین ترتیب این چند نفر ست"
      ".اساسی کاخ با عظمت و مجلل اسلام شدند",
    "مصعب بن عمیر بنا بر بعضی منابع شیعه  ۱۸امین فردی بود که مسلمان شد"
        "[۱وی از اشراف زادگان مکه بود و مدت ھا ایمان خود را از پدر"
   "و مادر خود مخفی نگاه داشته بود"
    ". سرانجام وقتی مسلمانی او آشکار شد خویشاوندان اش وی را طرد کردند"
        "وی پیش از پیمان عقبه اول به عنوان اولین معلم قرآن"
  "به یثرب اعزام شد."
    "در جنگ بدر و جنگ احد پرچم دار سپاه اسلام بود و در جریان جنگ احد و ھنگام دفاع از محمد در سال سوم ھجری در سی"
  "سالگی کشته شد. "
    ,
    "انَس بن مالک )وفات  ۹۳ھ.ق( از صحابهٔ محمد، پیامبر اسلام، و از انصار و قبیلهٔ خزرج بود. "
        ". پس از ھجرت محمد به مدینه، مادرش یا در نقلی"
  "شوھر مادرش او را برای خدمت به پیامبر، نزد او برد."
    "وی تا درگذشت محمد نزد او بود. پس از درگذشت پیامبر، از سوی ابوبکر مأمور به"
  "  رفتن به بحرین برای گرفتن صدقات شد"
    ""
    ,
    "وی در آغاز دعوت پیامبر)ص(، جزء دشمنان ایشان بود و در جنگ ھای بدر، احد و خندق، علیه مسلمانان حضوری فعال داشت. ابوسفیان"
  "در سال  ۸ھجری اسلام آورد و از سوی پیامبر)ص( به عنوان والی نجران انتخاب شد. او با خلفای اول و دوم با مماشات رفتار می کرد و از"
  "خلافت عثمان حمایت نمود. پسر او معاویه نقش سیاسی مھمی در سده اول قمری ایفا کرد و سلسله خلافت اموی را بنیاد نھاد",


    "زید بن ثابت از اصحاب ّ محمد صل الله علیه و آله و سلم پیغمبر اسلام و از جمله انصار است. او کاتب قرآن و نیز کاتب مراسلات ّ محمد بود و"
   " با زبان ھای عبری، کلدانی و آشوری آشنایی داشت]. [۱پس از مرگ ّ محمد، و پس از کشته شدن تنی چند از قاریان در نبرد یمامه، زید پسر ثابت"
 " از ابوبکر مأموریت یافت آیات قرآن را گردآوری کند.زید بن ثابت، با علی بن ابی طالب بیعت نکرد و در دوران خلافت معاویه در مدینه درگذشت",

    "زبیر بن عوام ) ۵۹۴میلادی –  ۶۵۴میلادی( یکی از مھم ترین صحابه ھای محمد بود و از سوی او ملقب به حواری وی گردید و به"
  "روایت عشره مبشره که در میان اھل سنت شایع است، جزو  ۱۰تنی است که محمد به آن ھا بھشت را وعده داد. وی ھمچنین جزو شورایی"
  "است که عمر بن خطاب در ھنگامی که در بستر مرگ بود تشکیل داد. ریشه نام زبیر از کلمه زبر، طی البئر بالحجاره گرفته شده که به معنای"
 " چاه سنگ یا مرد قوی است",

    " بلال بن رَباح معروف به بِلال حبشی در بین سال ھای  ۵۷۸تا  ۵۸۲میلادی در ّ مکه متولّد شد. او برده امیة بن خلف بود و پس از این "
  "که اسلام آورد امیّه او را به شکنجه و آزار گرفت. گفته شده او را به دست کودکان سپردند و آنھا او را در ّ دره ھای مکه می گرداندند و او پیوسته"
     " .می گفت: احد! احد! )خدای یکتا، خدای یکتا( او در سال  ۶۲۲میلادی، به مدینه ھجرت کرد و از آن پس در تمام جنگ ھا در سپاه اسلام می جنگید"
      ".او در جنگ بدر، ارباب سابقش امیّه پسر خلف را کشت. بلال ھم چنین در جنگ احد، خندق، بنی مصطلق و تبوک حضور داشت",

    "طلحه بن عبیدالله )به عربی: طلحة بن عبيد الله( صحابه مشھور محمد، معروف به طلحةالجواد، طلحةالجود، و طلحه الخیر] [۳ملقب به ابو"" محمد] [۴و از اولین اسلام آورندگان است و جزو ده تنی است که در روایت اھل سنت معروف به عشره مبشره، محمد به آنان وعده بھشت را"
  "داده است. وی جزو قبیله بنی تیم قریش بود",

    "عبدالله بن مسعود )به عربی: عبد الله بن مسعود( با نام کامل عبدالله بن مسعود بن غافل بن حبیب الھذلی معروف به ابن مسعود، از صحابه و"
 " یاران محمد بود. او را بزرگترین مفسر قرآن در زمان خود و دومین مفسر قرآن می دانند].  289 :[۱او ششمین مردی بود که در زمانی"
"  که محمد در مکه دعوت به اسلام را آغاز کرد، به اسلام گروید].:[۲وی از اولین حافظین قرآن در زمان محمد بوده و از مسلمانانی"
  "    .است که ھر دو گروه سنی و شیعه به او احترام می گذارند"


  ];

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
          backgroundColor: Colors.white,
          appBar: AppBar(
            actions: [
              PopupMenuButton(
                itemBuilder: (context) => [
                  const PopupMenuItem(value: 1, child: Text("Sharee the App")),
                  const PopupMenuItem(value: 2, child: Text("About")),
                  const PopupMenuItem(value: 3, child: Text("Exit")),
                ],
                onSelected: (value) {
                  if (value == 2) {
                    Navigator.push(context, MaterialPageRoute(
                      builder: (context) {
                        return const About();
                      },
                    ));
                  } else if (value == 3) {
                SystemNavigator.pop();
                  } else if (value == 1) {


                    Share.share("a pice of text");
                  }
                },
              )
            ],
            backgroundColor: Colors.purple,
            title: Center(
                child: const Text(
              "صحابه های جلیل القدر",
              textAlign: TextAlign.right,
            )),
          ),
          body: Padding(
            padding: const EdgeInsets.all(8.0),
            child: ListView.separated(
                itemBuilder: (context, i) {
                  return Card(
                    child: ListTile(
                      onTap: () {
                        Navigator.push(context,
                            MaterialPageRoute(builder: (builder) {
                          return Information(
                            title: names[i],
                            details: details[i],
                            photo: images[i],
                            link: link[i],
                          );
                        }));
                      },
                      leading: Image.asset(
                        '${images[i]}.jpg',
                        width: 70,
                        height: 70,
                      ),
                      title: Center(child: Text(names[i])),
                    ),
                  );
                },
                separatorBuilder: (context, i) {
                  return Divider();
                },
                itemCount: images.length),
          )),
    );
  }
}
